In [1]:
import pandas as pd
import numpy as np

In [27]:
df_01 = pd.read_csv("./data/highway_01_07.csv")
df_02 = pd.read_csv("./data/highway_08_12.csv")

In [29]:
def reform():
    new_list = []
    for i in range(df_02.shape[0]):
        kor = ["경기", "충청","전라","경상","강원"]
        eng = ["Gyeonggi", "Chungcheong", "Jeolla", "Gyeongsang", "Gangwon"]
        for j in range(5):
            if df_02["StartPoint"][i] == kor[j]:
                new_list.append(eng[j])
    df_02["StartPoint"] = new_list

reform()

In [31]:
df_02.head(2)

       date StartPoint  Gyeonggi  Chungcheong  Jeolla  Gyeongsang   Gangwon
0  20140801    Gangwon   63365.0       7044.0   892.0      1756.0  140258.0
1  20140801   Gyeonggi  553781.0     110895.0  9961.0     12596.0   89665.0

In [33]:
df_01.head(1)

       date   StartPoint  Gyeonggi  Chungcheong  Jeolla  Gyeongsang  Gangwon
0  20140101  Chungcheong   83318.0     104617.0  4147.0      4126.0   6021.0

In [43]:
df = pd.concat([df_01, df_02])

In [64]:
df

,date,StartPoint,Gyeonggi,Chungcheong,Jeolla,Gyeongsang,Gangwon
0,20140101,Chungcheong,83318.0,104617.0,4147.0,4126.0,6021.0
1,20140101,Gangwon,57398.0,5783.0,427.0,991.0,102850.0
2,20140101,Gyeonggi,373199.0,82263.0,3114.0,5841.0,51386.0
3,20140101,Gyeongsang,6926.0,5368.0,15514.0,334217.0,986.0
4,20140101,Jeolla,3298.0,4759.0,130474.0,14832.0,478.0
...,...,...,...,...,...,...,...
760,20141231,Gangwon,45095.0,5978.0,676.0,1243.0,81547.0
761,20141231,Gyeonggi,558204.0,89242.0,4809.0,9903.0,59000.0
762,20141231,Gyeongsang,9604.0,5657.0,14685.0,380287.0,1538.0
763,20141231,Jeolla,3679.0,4224.0,134007.0,14128.0,640.0
764,20141231,Chungcheong,93899.0,145433.0,6041.0,7119.0,8084.0

In [95]:
def exec():
    eng = ["Gyeonggi", "Chungcheong", "Jeolla", "Gyeongsang", "Gangwon"]
    list = []
    target = df.loc[df["StartPoint"] == "Gangwon"].reset_index(drop=True)
    for j in range(5):
        for i in range(target.shape[0]):
            list.append(target[eng[j]][i])
        
    return list

In [99]:
rtn = exec()
gangwonTotal = pd.DataFrame(rtn, columns=["val"])
gangwonTotal.sort_values(by=["val"])

           val
861      315.0
770      327.0
771      328.0
806      329.0
765      330.0
...        ...
1687  147135.0
1673  160509.0
1710  163533.0
1584  176174.0
1583  177368.0

[1825 rows x 1 columns]

In [104]:
q1 = gangwonTotal.quantile(0.25)
q2 = gangwonTotal.quantile(0.5)
q3 = gangwonTotal.quantile(0.75)
print(q1.val, ' / ', q2.val , '/', q3.val)

988.0  /  5455.0 / 54882.0